<a href="https://colab.research.google.com/github/KhushbooSingh17/18CSE140/blob/main/Assignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [6]:
#Toyota dataset comma separated value
path = "https://raw.githubusercontent.com/chirudukuru/DMDW/main/Toyota.csv"

In [7]:
import pandas as pd

In [8]:
data = pd.read_csv(path)

In [9]:
data

      Unnamed: 0  Price   Age     KM  ... Automatic    CC  Doors  Weight
0              0  13500  23.0  46986  ...         0  2000  three    1165
1              1  13750  23.0  72937  ...         0  2000      3    1165
2              2  13950  24.0  41711  ...         0  2000      3    1165
3              3  14950  26.0  48000  ...         0  2000      3    1165
4              4  13750  30.0  38500  ...         0  2000      3    1170
...          ...    ...   ...    ...  ...       ...   ...    ...     ...
1431        1431   7500   NaN  20544  ...         0  1300      3    1025
1432        1432  10845  72.0     ??  ...         0  1300      3    1015
1433        1433   8500   NaN  17016  ...         0  1300      3    1015
1434        1434   7250  70.0     ??  ...         0  1300      3    1015
1435        1435   6950  76.0      1  ...         0  1600      5    1114

[1436 rows x 11 columns]

In [10]:
data = pd.read_csv("https://raw.githubusercontent.com/chirudukuru/DMDW/main/Toyota.csv",index_col="Unnamed: 0")

In [11]:
data

      Price   Age     KM FuelType  ... Automatic    CC  Doors  Weight
0     13500  23.0  46986   Diesel  ...         0  2000  three    1165
1     13750  23.0  72937   Diesel  ...         0  2000      3    1165
2     13950  24.0  41711   Diesel  ...         0  2000      3    1165
3     14950  26.0  48000   Diesel  ...         0  2000      3    1165
4     13750  30.0  38500   Diesel  ...         0  2000      3    1170
...     ...   ...    ...      ...  ...       ...   ...    ...     ...
1431   7500   NaN  20544   Petrol  ...         0  1300      3    1025
1432  10845  72.0     ??   Petrol  ...         0  1300      3    1015
1433   8500   NaN  17016   Petrol  ...         0  1300      3    1015
1434   7250  70.0     ??      NaN  ...         0  1300      3    1015
1435   6950  76.0      1   Petrol  ...         0  1600      5    1114

[1436 rows x 10 columns]

In [12]:
type(data)

pandas.core.frame.DataFrame

In [13]:
data.shape

(1436, 10)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

In [15]:
data.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            1426, 1427, 1428, 1429, 1430, 1431, 1432, 1433, 1434, 1435],
           dtype='int64', length=1436)

In [16]:
data.columns

Index(['Price', 'Age', 'KM', 'FuelType', 'HP', 'MetColor', 'Automatic', 'CC',
       'Doors', 'Weight'],
      dtype='object')

In [17]:
data.head()

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165
3  14950  26.0  48000   Diesel  90       0.0          0  2000      3    1165
4  13750  30.0  38500   Diesel  90       0.0          0  2000      3    1170

In [18]:
data.tail()

      Price   Age     KM FuelType   HP  MetColor  Automatic    CC Doors  Weight
1431   7500   NaN  20544   Petrol   86       1.0          0  1300     3    1025
1432  10845  72.0     ??   Petrol   86       0.0          0  1300     3    1015
1433   8500   NaN  17016   Petrol   86       0.0          0  1300     3    1015
1434   7250  70.0     ??      NaN   86       1.0          0  1300     3    1015
1435   6950  76.0      1   Petrol  110       0.0          0  1600     5    1114

In [19]:
data.head(3)

   Price   Age     KM FuelType  HP  MetColor  Automatic    CC  Doors  Weight
0  13500  23.0  46986   Diesel  90       1.0          0  2000  three    1165
1  13750  23.0  72937   Diesel  90       1.0          0  2000      3    1165
2  13950  24.0  41711   Diesel  90       NaN          0  2000      3    1165

In [20]:
data[['Price',"Age"]].head(10)

   Price   Age
0  13500  23.0
1  13750  23.0
2  13950  24.0
3  14950  26.0
4  13750  30.0
5  12950  32.0
6  16900  27.0
7  18600  30.0
8  21500  27.0
9  12950  23.0

In [21]:
### Data Wrangling (Working With Null Values)
data.isnull().sum()

Price          0
Age          100
KM             0
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [22]:
data.dropna(inplace=True) # removed the null values 1st method remove rows when large data we having
data.isnull().sum()

Price        0
Age          0
KM           0
FuelType     0
HP           0
MetColor     0
Automatic    0
CC           0
Doors        0
Weight       0
dtype: int64

In [23]:
data.shape

(1111, 10)

In [24]:
data.head(10)    # After removal of nullvalue rows

    Price   Age     KM FuelType   HP  MetColor  Automatic    CC  Doors  Weight
0   13500  23.0  46986   Diesel   90       1.0          0  2000  three    1165
1   13750  23.0  72937   Diesel   90       1.0          0  2000      3    1165
3   14950  26.0  48000   Diesel   90       0.0          0  2000      3    1165
4   13750  30.0  38500   Diesel   90       0.0          0  2000      3    1170
5   12950  32.0  61000   Diesel   90       0.0          0  2000      3    1170
8   21500  27.0  19700   Petrol  192       0.0          0  1800      3    1185
10  20950  25.0  31461   Petrol  192       0.0          0  1800      3    1185
11  19950  22.0  43610   Petrol  192       0.0          0  1800      3    1185
12  19600  25.0  32189   Petrol  192       0.0          0  1800      3    1185
13  21500  31.0  23000   Petrol  192       1.0          0  1800      3    1185

In [25]:
#2nd method handling missing values
data['MetColor'].mean()

0.6750675067506751

In [26]:
data['MetColor'].head()

0    1.0
1    1.0
3    0.0
4    0.0
5    0.0
Name: MetColor, dtype: float64

In [28]:
import numpy as np

In [29]:
data['MetColor'].replace(np.NaN,data['MetColor'].mean()).head()

0    1.0
1    1.0
3    0.0
4    0.0
5    0.0
Name: MetColor, dtype: float64